AUTO_config_TK_pesok/src/Documents/АссортиментныйКомитет/АссортиментныйКомитет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АссортиментныйКомитет</name>
  <posting>Deny</posting>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыАссортиментногоКомитета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Поставщик/комитент от которого мы получили товар</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Таблица товаров и услуг</comment>
    <attributes>
      <name>Артикул</name>
      <comment>Артикул</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроизводитель</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКодТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеТовараДляЦенника</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеТовараДляНН</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаПродажиТовара</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесКг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <comment>(свойство)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Жирность</name>
      <comment>(свойство)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентАлкоголя</name>
      <comment>(свойство)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипИндикатива</name>
      <comment>(свойство)</comment>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХраненияТовара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокРеализации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВходнаяСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаценкаРозница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаценкаПремиум</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦеновойСегмент</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>СоциальныйТовар</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РозничнаяЦенаКонкурента1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РозничнаяЦенаКонкурента2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РозничнаяЦенаКонкурента3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодУКТВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторУКТВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Глубина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВУпаковке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КвантПоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходВТорговуюСеть</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВходПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РетроБонус</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТТДляВвода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтсрочкаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварнаяМарка</name>
      <type>
        <types>CatalogRef.ТоварныеМарки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланПродажГрн</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланПродажШт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВозврата</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВозвратаПримечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ввод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаТестирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияТестирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейТестирования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйАссортимент</name>
      <comment>Товар вводится в базовый ассортимет</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАссортимента</name>
      <type>
        <types>CatalogRef.ВидыАссортимента</types>
      </type>
    </attributes>
    <attributes>
      <name>РозничнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументАссортимента</name>
      <type>
        <types>DocumentRef.ИзменениеАссортимента</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛокализованноеНаименование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипНоменклатуры</name>
      <comment>Тип номенклатуры</comment>
      <type>
        <types>CatalogRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидНоменклатуры</name>
      <comment>Вид номенклатуры</comment>
      <type>
        <types>EnumRef.ВидыНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаЦенообразования</name>
      <comment>(АСУ by 4ok)</comment>
      <type>
        <types>CatalogRef.ГруппыЦенообразования</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипНоменклатурыПланирования</name>
      <type>
        <types>CatalogRef.ТипНоменклатурыПланирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияУпаковки</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКодТовара_Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияЯщиков</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКодТовара_Ящик</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Емкость</name>
      <comment>(свойство)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Направление</name>
      <comment>(свойство)</comment>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Цвет</name>
      <comment>(свойство)</comment>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидБоя</name>
      <comment>(свойство)</comment>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВЯщике</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПлощадкиПоСтроке</name>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТорговаяПлощадка</name>
      <type>
        <types>CatalogRef.ТорговыеПлощадки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Enums/СтатусыАссортиментногоКомитета/СтатусыАссортиментногоКомитета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыАссортиментногоКомитета</name>
  <comment>Статус документа АссортиментныйКомитет</comment>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Проверен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Documents/АссортиментныйКомитет/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ
&НаКлиенте
Перем ТекущаяСтрокаТовары;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РольПолная = РольДоступна("ПолныеПрава");
	РольПроверка = РольДоступна("ПроверкаАссортиментногоКомитета");
	РольУтверждение = РольДоступна("УтверждениеАссортиментногоКомитета");
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	//СписокВидимыхКолонок = Новый СписокЗначений;
	СписокВидимыхКолонок.Добавить("ТоварыНомерСтроки");
	СписокВидимыхКолонок.Добавить("ТоварыАртикул");
	СписокВидимыхКолонок.Добавить("ТоварыНоменклатура");
	СписокВидимыхКолонок.Добавить("ТоварыВидАссортимента");
	СписокВидимыхКолонок.Добавить("ТоварыДокументАссортимента");
	
	//// СтандартныеПодсистемы.Свойства
	//ДополнительныеПараметры = Новый Структура;
	////ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", Элементы.ГруппаДополнительныеРеквизиты.Имя);
	////ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	////УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, Допо лнительныеПараметры);
	//УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, Неопределено);
	//// Конец СтандартныеПодсистемы.Свойства
	
	Элементы.ХозОперация.СписокВыбора.ЗагрузитьЗначения(ЗначениеНастроекПовтИсп.ПолучитьХозОперацииДокумента("АссортиментныйКомитет"));
	
	Элементы.ТоварыСоздатьОбновитьНоменклатуру.Видимость = Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВводНовогоТовараВАссортимент") И Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыАссортиментногоКомитета.Утвержден");
	
	Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыАссортиментногоКомитета.Черновик);
	Если РольПолная ИЛИ РольПроверка ИЛИ Объект.Статус = Перечисления.СтатусыАссортиментногоКомитета.Проверен Тогда
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыАссортиментногоКомитета.Проверен);
	КонецЕсли;
	Если РольПолная ИЛИ (РольУтверждение И Объект.Статус = Перечисления.СтатусыАссортиментногоКомитета.Проверен) ИЛИ Объект.Статус = Перечисления.СтатусыАссортиментногоКомитета.Утвержден Тогда
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыАссортиментногоКомитета.Утвержден);
	КонецЕсли;
	Если РольПолная ИЛИ Объект.Статус = Перечисления.СтатусыАссортиментногоКомитета.Обработан Тогда
		Элементы.Статус.СписокВыбора.Добавить(Перечисления.СтатусыАссортиментногоКомитета.Обработан);
	КонецЕсли;
	
	Если РольПолная Тогда 
		Элементы.Статус.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Статус.ТолькоПросмотр = (Объект.Статус = Перечисления.СтатусыАссортиментногоКомитета.Утвержден И РольПроверка И НЕ РольУтверждение)
		ИЛИ НЕ (Объект.Статус <> Перечисления.СтатусыАссортиментногоКомитета.Обработан И (РольУтверждение ИЛИ РольПроверка));
	КонецЕсли;
	
	// Запрещено редактировать "обработанный" документ
	Если Объект.Статус = Перечисления.СтатусыАссортиментногоКомитета.Обработан Тогда 
		ЭтаФорма.ТолькоПросмотр = НЕ РольПолная;
	ИначеЕсли Объект.Статус = Перечисления.СтатусыАссортиментногоКомитета.Утвержден Тогда
		ЭтаФорма.ТолькоПросмотр = НЕ (РольПолная Или НЕ РольПроверка ИЛИ РольУтверждение);
	КонецЕсли;
	
	Элементы.ГруппаПлощадкиПоСтроке.Видимость = РольПолная;
	
	Элементы.ТоварыУстановитьТекущийВидАссортимента.Видимость = Объект.ХозОперация <> ПредопределенноеЗначение("Справочник.ХозОперации.ВыводТоваровИзАссортимента") И Объект.ХозОперация <> ПредопределенноеЗначение("Справочник.ХозОперации.РаспродажаСПоследующимВыводомИзАссортимента");
	Элементы.ВыбранныеТорговыеПлощадкиЗаполнитьПлощадкиПоАссортименту.Видимость = Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВыводТоваровИзАссортимента") ИЛИ Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.РаспродажаСПоследующимВыводомИзАссортимента");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	УстановитьВидимостьКолонок();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ТК_УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец ТК_УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения	
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	//// Конец СтандартныеПодсистемы.Свойства
	
	ПриЧтенииСозданииНаСервере();
	
	УстановитьСостояниеДокумента();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//// СтандартныеПодсистемы.Свойства 
	//Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
	//	ОбновитьЭлементыДополнительныхРеквизитов();
	//	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	//КонецЕсли;
	//// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	//// СтандартныеПодсистемы.Свойства
	//УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	//// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыАссортиментногоКомитета.Утвержден") И ПроверитьВыборПлощадокПоСтроке() Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(,"Нельзя ""Утверждать"" не полностью заполненный документ!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// ТК_УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ТК_УправлениеДоступом
	
	УстановитьСостояниеДокумента();
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ХозОперацияПриИзменении(Элемент)
	Элементы.ТоварыСоздатьОбновитьНоменклатуру.Видимость = Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВводНовогоТовараВАссортимент");
	Элементы.ТоварыУстановитьТекущийВидАссортимента.Видимость = Объект.ХозОперация <> ПредопределенноеЗначение("Справочник.ХозОперации.ВыводТоваровИзАссортимента") И Объект.ХозОперация <> ПредопределенноеЗначение("Справочник.ХозОперации.РаспродажаСПоследующимВыводомИзАссортимента");
	Элементы.ВыбранныеТорговыеПлощадкиЗаполнитьПлощадкиПоАссортименту.Видимость = Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВыводТоваровИзАссортимента") ИЛИ Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.РаспродажаСПоследующимВыводомИзАссортимента");
	УстановитьВидимостьКолонок();
КонецПроцедуры

&НаСервере
Функция ПроверитьВыборПлощадокПоСтроке()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Площадки.КлючСтроки КАК КлючСтроки,
	|	Площадки.ТорговаяПлощадка КАК ТорговаяПлощадка
	|ПОМЕСТИТЬ втПлощадки
	|ИЗ
	|	&Площадки КАК Площадки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.КлючСтроки КАК КлючСтроки,
	|	Товары.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ втТовары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТовары.КлючСтроки КАК КлючСтроки,
	|	втТовары.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	втТовары КАК втТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПлощадки КАК втПлощадки
	|		ПО втТовары.КлючСтроки = втПлощадки.КлючСтроки
	|ГДЕ
	|	втПлощадки.КлючСтроки ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Площадки", Объект.ПлощадкиПоСтроке.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();	//	РезультатЗапроса.Выгрузить()
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сообщить("Для строки - "+Выборка.НомерСтроки+" не выбрано ни одной точки!!!");
	КонецЦикла;
	
	Возврат НЕ РезультатЗапроса.Пустой();
КонецФункции

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Если (Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыАссортиментногоКомитета.Утвержден") ИЛИ Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыАссортиментногоКомитета.Проверен")) И ПроверитьВыборПлощадокПоСтроке() Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыАссортиментногоКомитета.Черновик");
		ПоказатьПредупреждение(,"У Вас же не полностью заполненный документ!");
	КонецЕсли;
	Элементы.ТоварыСоздатьОбновитьНоменклатуру.Видимость = Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыАссортиментногоКомитета.Черновик");
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
	Элемент.ТекстРедактирования, 
	ЭтотОбъект, 
	"Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеКомпанииПриИзменении(Элемент)
	Объект.ПлощадкиПоСтроке.Очистить();
	КлючСтроки = Элементы.Товары.ТекущиеДанные.КлючСтроки;
	ЗаполнитьДеревоТорговыхПолощадок(КлючСтроки);
	Элементы.ВыбранныеТорговыеПлощадкиТорговаяПлощадка.Заголовок = "Объектов "+КоличествоТТПоСтроке(КлючСтроки);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущаяСтрока <> Неопределено И Элемент.ТекущаяСтрока <> ТекущаяСтрокаТовары Тогда
		ТекущаяСтрокаТовары = Элемент.ТекущаяСтрока;
		ЗаполнитьДеревоТорговыхПолощадок(Элемент.ТекущиеДанные.КлючСтроки);
		//Элементы.ВыбранныеТорговыеПлощадки.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
		//СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтаФорма,"ВыбранныеТорговыеПлощадки");
		Элементы.ВыбранныеТорговыеПлощадкиТорговаяПлощадка.Заголовок = "Объектов "+КоличествоТТПоСтроке(Элемент.ТекущиеДанные.КлючСтроки);
		Элементы.ВыбранныеТорговыеПлощадкиТорговаяПлощадка.ЦветТекстаЗаголовка = WebЦвета.Синий;
		Элементы.ВыбранныеТорговыеПлощадкиТорговаяПлощадка.ШрифтЗаголовка = Новый Шрифт(,,Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Или Копирование Тогда
		Элемент.ТекущиеДанные.КлючСтроки = 1 + ПолучитьМаксКлючСтроки();
	КонецЕсли;
	Если Копирование Тогда
		Элемент.ТекущиеДанные.ДокументАссортимента = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элементы.ВыбранныеТорговыеПлощадки.ТолькоПросмотр = Объект.Товары.Количество()=0;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	мСтрок = Объект.ПлощадкиПоСтроке.НайтиСтроки(Новый Структура("КлючСтроки",Элемент.ТекущиеДанные.КлючСтроки));
	Для Каждого строка Из мСтрок Цикл
		Объект.ПлощадкиПоСтроке.Удалить(строка);		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	Если Объект.Товары.Количество() = 0 Тогда
		ВыбранныеТорговыеПлощадки.ПолучитьЭлементы().Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАртикулПоНоменклатуре(Номенклатура)
	Возврат Номенклатура.Артикул;
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Артикул = ПолучитьАртикулПоНоменклатуре(ТекущиеДанные.Номенклатура);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНоменклатуруПоАртикулу(Артикул)
	Возврат Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
КонецФункции

&НаКлиенте
Процедура ТоварыАртикулПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Номенклатура = ПолучитьНоменклатуруПоАртикулу(ТекущиеДанные.Артикул);
КонецПроцедуры



#КонецОбласти


#Область СобытиеТабличнойЧастиТорговыеПлощадки

&НаКлиенте
Процедура ВыбранныеТорговыеПлощадкиВыбранаПриИзменении(Элемент)
	
	ИДТекущейСтроки =  Элементы.ВыбранныеТорговыеПлощадки.ТекущаяСтрока;
	Если ИДТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Модифицированность = Истина;
	
	ЭлементКоллекции = ЭтаФорма.ВыбранныеТорговыеПлощадки.НайтиПоИдентификатору(ИДТекущейСтроки);
	
	ЗначениеФлажка = ЭлементКоллекции.Выбрана;
	УстановкаФлажков(ЭлементКоллекции,ЗначениеФлажка);
	
КонецПроцедуры


#КонецОбласти



#Область ОбработчикиКомандФормы

//// СтандартныеПодсистемы.Свойства
//&НаКлиенте
//Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
//	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
//КонецПроцедуры
//// Конец СтандартныеПодсистемы.Свойства


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды



// СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла
&НаКлиенте
Процедура ЗагрузитьТоварыИзФайла(Команда)
	
	ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
	ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "АссортиментныйКомитет.Товары";
	ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка списка товаров из файла'; uk = 'Завантаження списка товарів із файлу'");		
	//ПараметрыЗагрузки.ДополнительныеПараметры = Новый структура;
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьТоварыИзФайлаЗавершение", ЭтотОбъект);
	ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТоварыИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьТоварыИзФайлаНаСервере(АдресЗагруженныхДанных);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТоварыИзФайлаНаСервере(АдресЗагруженныхДанных)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");	
	//ДобавитьДействиеЗаполненияЦен(СтруктураДействий, Объект);
	//ДобавитьВСтруктуруДействияПриИзмененииКоличества(СтруктураДействий);
	//ДобавитьДействиеПересчетаРасхождений(СтруктураДействий, Истина, Истина);	
	СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога");	
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));		
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	ТоварыДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл         
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаТовары = Объект.Товары.Добавить();
		НоваяСтрокаТовары.Номенклатура = СтрокаТаблицы.Номенклатура;
		//НоваяСтрокаТовары.Количество = СтрокаТаблицы.Количество;
		
		СтруктураДействий.Вставить("ПроверитьЗаполнитьЕдиницуИзмеренийПоВладельцу", НоваяСтрокаТовары.ЕдиницаИзмерения);				
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрокаТовары, СтруктураДействий, КэшированныеЗначения); 
		
		ТоварыДобавлены = Истина;
	КонецЦикла;
	
	Если ТоварыДобавлены Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла

&НаКлиенте
Процедура ЗаполнитьТоварыПоСписку(Команда)
	Данные = Новый Структура;
	Данные.Вставить("Данные","Номенклатура");
	ЗаполнитьПоСписку(Данные);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлощадки(Команда)
	Данные = Новый Структура;
	Данные.Вставить("Данные","Площадки");
	Данные.Вставить("КлючСтроки",Элементы.Товары.ТекущиеДанные.КлючСтроки);
	ЗаполнитьПоСписку(Данные);
КонецПроцедуры


&НаКлиенте
Процедура СоздатьОбновитьНоменклатуру(Команда)
	Если Параметры.Ключ.Пустая()
		ИЛИ ЭтаФорма.Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
		ТекстВопроса = "Перед выпонением данной операции документ должен быть записан! Продолжить?";
		ПоказатьВопрос(Оповещение,ТекстВопроса,РежимДиалогаВопрос.ДаНет,15,КодВозвратаДиалога.Нет,"Предупреждение",КодВозвратаДиалога.Нет);
	Иначе
		ПроверитьСоздатьОбновитьНоменклатуру();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоздатьОбновитьНоменклатуру()
	
	СтруктураОбязательныхРеквизитов = Новый Структура();
	СтруктураобязательныхРеквизитов.Вставить("Артикул", "Артикул");
	СтруктураобязательныхРеквизитов.Вставить("ТоварнаяМарка", "Товарная марка");
	СтруктураобязательныхРеквизитов.Вставить("ШтрихКодТовара", "Штрих-код товара");
	//СтруктураобязательныхРеквизитов.Вставить("ШтрихКодТовара_Ящик", "Штрих-код ящика");
	СтруктураобязательныхРеквизитов.Вставить("ЛокализованноеНаименование", "Наименование");
	СтруктураобязательныхРеквизитов.Вставить("НазваниеТовараДляЦенника", "Наименование для ценника");
	СтруктураобязательныхРеквизитов.Вставить("НазваниеТовараДляНН", "наименование для НН");
	СтруктураобязательныхРеквизитов.Вставить("ЕдиницаПродажиТовара", "Базовая единица");
	СтруктураобязательныхРеквизитов.Вставить("ВесКг", "Вес");
	СтруктураобязательныхРеквизитов.Вставить("ТипНоменклатуры", "Тип номенклатуры");
	СтруктураобязательныхРеквизитов.Вставить("ТипНоменклатурыПланирования", "Тип номенклатуры планирования");
	СтруктураобязательныхРеквизитов.Вставить("ВидНоменклатуры", "Вид номенклатуры");
	СтруктураобязательныхРеквизитов.Вставить("ГруппаЦенообразования", "Группа ценообразования");
	СтруктураобязательныхРеквизитов.Вставить("ЕдиницаИзмеренияЯщиков", "Единица измерения ящиков");
	
	// перед созданием/обновлением номенклатуры проверим заполненность реквизитов
	ЕстьОшибки = Ложь;
	Для Каждого ТекСтрокаНоменклатура из Объект.Товары Цикл
		Для каждого КлючИЗначение Из СтруктураобязательныхРеквизитов Цикл
			Если НЕ ЗначениеЗаполнено(ТекСтрокаНоменклатура[КлючИЗначение.Ключ]) Тогда
				ЕстьОшибки = Истина;
				Сообщить("В строке " + ТекСтрокаНоменклатура.НомерСтроки + " реквизит <" + КлючИЗначение.Значение +"> не заполнен!", СтатусСообщения.Важное);
			КонецЕсли;
			
			//Если ТекСтрокаНоменклатура.ТипНоменклатуры.ЭтоГруппа Тогда
			//	Сообщить("В строке " + ТекСтрокаНоменклатура.НомерСтроки + " указан неверный Тип номенклатуры, необходимо выбрать элемент, а не папку, строка пропущена при обработке",СтатусСообщения.ОченьВажное);
			//	Продолжить;	
			//КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		ПоказатьПредупреждение(,"Обнаружены ошибки заполнения строк! Создание / обновление номенклатуры прервано!");
		Возврат;
	КонецЕсли;
	
	СоздатьОбновитьНоменклатуруНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОбновитьНоменклатуруНаСервере()
	
	Документы.АссортиментныйКомитет.СоздатьОбновитьНоменклатуру();	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДляВыделенныхТекущийВидАссортимента(Команда)
	ВидАссортимента = Элементы.Товары.ТекущиеДанные.ВидАссортимента;	
	Для Каждого ВыделеннаяСтрока Из Элементы.Товары.ВыделенныеСтроки Цикл
		Элементы.Товары.ДанныеСтроки(ВыделеннаяСтрока).ВидАссортимента = ВидАссортимента;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДляВыделенныхТекущиеПлощадки(Команда)
	мКлючиСтрок = Новый Массив;
	КлючСтрокиШаблон = Элементы.Товары.ТекущиеДанные.КлючСтроки;
	Для Каждого ВыделеннаяСтрока Из Элементы.Товары.ВыделенныеСтроки Цикл
		СтрокаТЧ = Элементы.Товары.ДанныеСтроки(ВыделеннаяСтрока);
		Если СтрокаТЧ.КлючСтроки = КлючСтрокиШаблон Тогда
			Продолжить;
		КонецЕсли;
		мКлючиСтрок.Добавить(Элементы.Товары.ДанныеСтроки(ВыделеннаяСтрока).КлючСтроки);
	КонецЦикла;
	ЗаполнитьПлощадкиПоШаблону(КлючСтрокиШаблон,мКлючиСтрок);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлощадкиПоШаблону(КлючСтрокиШаблон,мКлючиСтрок)
	
	Для Каждого Ключ Из мКлючиСтрок Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	тчПлощадки.КлючСтроки КАК КлючСтроки,
		|	тчПлощадки.ТорговаяПлощадка КАК ТорговаяПлощадка
		|ПОМЕСТИТЬ втПлощадки
		|ИЗ
		|	&тчПлощадки КАК тчПлощадки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПлощадки.КлючСтроки КАК КлючСтроки,
		|	втПлощадки.ТорговаяПлощадка КАК ТорговаяПлощадка
		|ПОМЕСТИТЬ втШаблон
		|ИЗ
		|	втПлощадки КАК втПлощадки
		|ГДЕ
		|	втПлощадки.КлючСтроки = &КлючШаблон
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПлощадки.КлючСтроки КАК КлючСтроки,
		|	втПлощадки.ТорговаяПлощадка КАК ТорговаяПлощадка
		|ИЗ
		|	втПлощадки КАК втПлощадки
		|ГДЕ
		|	втПлощадки.КлючСтроки <> &Ключ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Ключ,
		|	втШаблон.ТорговаяПлощадка
		|ИЗ
		|	втШаблон КАК втШаблон";
		
		Запрос.УстановитьПараметр("тчПлощадки", Объект.ПлощадкиПоСтроке.Выгрузить());
		Запрос.УстановитьПараметр("КлючШаблон", КлючСтрокиШаблон);
		Запрос.УстановитьПараметр("Ключ", Ключ);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Объект.ПлощадкиПоСтроке.Загрузить(РезультатЗапроса);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлощадкиПоАссортиментуНаСервере(КлючСтроки)
	
	СоответствиеПлощадок = Новый Соответствие;
	СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000002"),Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000110"));	//	ТС АТТИКА
	СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("AT000009"),Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000285"));		//	ТС Табак-Дигма
	СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000008"),Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("YY000118"));		//	ТС Buffet
	СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000001"),Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("YY000090"));		//	ТС ДИГМА
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тзТовар.Номенклатура КАК Номенклатура,
	|	тзТовар.КлючСтроки КАК КлючСтроки
	|ПОМЕСТИТЬ втТовар
	|ИЗ
	|	&тзТовар КАК тзТовар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОграничениеАссортиментаСрезПоследних.Номенклатура КАК Номенклатура,
	|	втТовар.КлючСтроки КАК КлючСтроки,
	|	ОграничениеАссортиментаСрезПоследних.ТорговаяПлощадка КАК ТорговаяПлощадка
	|ИЗ
	|	РегистрСведений.ОграничениеАссортимента.СрезПоследних(&НаДату, ТорговаяПлощадка В ИЕРАРХИИ (&Площадка)) КАК ОграничениеАссортиментаСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТовар КАК втТовар
	|		ПО ОграничениеАссортиментаСрезПоследних.Номенклатура = втТовар.Номенклатура";
	
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("НаДату", Объект.ДатаНачалаДействия);
	Запрос.УстановитьПараметр("тзТовар", Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("Площадка", СоответствиеПлощадок.Получить(Объект.ПодразделениеКомпании));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Объект.ПлощадкиПоСтроке.Загрузить(РезультатЗапроса);
	
	ЗаполнитьДеревоТорговыхПолощадок(КлючСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлощадкиПоАссортименту(Команда)
	КлючСтроки = Элементы.Товары.ТекущиеДанные.КлючСтроки;
	ЗаполнитьПлощадкиПоАссортиментуНаСервере(КлючСтроки);
	Элементы.ВыбранныеТорговыеПлощадкиТорговаяПлощадка.Заголовок = "Объектов "+КоличествоТТПоСтроке(КлючСтроки);
КонецПроцедуры



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

//// СтандартныеПодсистемы.Свойства 
//&НаСервере
//Процедура ОбновитьЭлементыДополнительныхРеквизитов()
//	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
//	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
//	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
//КонецПроцедуры

//&НаСервере
//Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
//	УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
//КонецПроцедуры

//// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//УсловноеОформление.Элементы.Очистить();
	//
	//спСправочники.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма);
	//
	//УстановитьОформлениеЦенИзПротокола();
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияТК.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонок()
	
	Для Каждого Колонка из Элементы.Товары.ПодчиненныеЭлементы Цикл
		Если Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВводНовогоТовараВАссортимент") Тогда
			Колонка.Видимость = Истина;	
		Иначе
			Колонка.Видимость = СписокВидимыхКолонок.НайтиПоЗначению(Колонка.Имя) <> Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ВыводТоваровИзАссортимента") ИЛИ Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.РаспродажаСПоследующимВыводомИзАссортимента") Тогда
		Элементы.ТоварыВидАссортимента.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоТорговыхПолощадок(КлючСтроки)
	ДеревоТорговыхПлощадок = РеквизитФормыВЗначение("ВыбранныеТорговыеПлощадки");
	ДеревоТорговыхПлощадок.Строки.Очистить();
	
	СоответствиеПлощадок = Новый Соответствие;
	Попытка
		СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000002"),Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000110"));	//	ТС АТТИКА
	Исключение
	КонецПопытки;
	Попытка
		СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("AT000009"),Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000285"));	//	ТС Табакко
	Исключение
	КонецПопытки;
	Попытка
		СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000008"),Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("YY000118"));	//	ТС Buffet
	Исключение
	КонецПопытки;
	Попытка
		СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("AT000014"),Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("GL000165"));	//	ТС Фабрика сыра
	Исключение
	КонецПопытки;
	Попытка
		СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("AT000011"),Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL001326"));	//	ТС Кур-кума Полтава
	Исключение
	КонецПопытки;
	
	ГруппаПлощадок = СоответствиеПлощадок.Получить(Объект.ПодразделениеКомпании);
	
	Если ЗначениеЗаполнено(ГруппаПлощадок) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Площадки.КлючСтроки КАК КлючСтроки,
		|	Площадки.ТорговаяПлощадка КАК ТорговаяПлощадка
		|ПОМЕСТИТЬ втПлощадки
		|ИЗ
		|	&Площадки КАК Площадки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СкладыКомпании.АссортиментнаяМатрица, """") КАК Матрица,
		|	ТорговыеПлощадки.Ссылка КАК ТорговаяПлощадка,
		|	СкладыКомпании.Ссылка КАК Склад,
		|	ВЫБОР
		|		КОГДА втПлощадки.ТорговаяПлощадка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Выбрана,
		|	ВЫБОР
		|		КОГДА втПлощадки.ТорговаяПлощадка ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Выбранных
		|ИЗ
		|	Справочник.ТорговыеПлощадки КАК ТорговыеПлощадки
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПлощадки КАК втПлощадки
		|		ПО (втПлощадки.КлючСтроки = &КлючСтроки)
		|			И ТорговыеПлощадки.Ссылка = втПлощадки.ТорговаяПлощадка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СкладыКомпании КАК СкладыКомпании
		|		ПО ТорговыеПлощадки.Ссылка = СкладыКомпании.ТорговаяПлощадка
		|			И (СкладыКомпании.АссортиментнаяМатрица <> ЗНАЧЕНИЕ(Справочник.АссортиментнаяМатрица.ПустаяСсылка))
		|ГДЕ
		|	ТорговыеПлощадки.Ссылка В ИЕРАРХИИ(&Площадка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Матрица УБЫВ,
		|	Склад,
		|	ТорговаяПлощадка
		|ИТОГИ
		|	СУММА(Выбранных)
		|ПО
		|	Матрица
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Площадки", Объект.ПлощадкиПоСтроке.Выгрузить());
		Запрос.УстановитьПараметр("КлючСтроки", КлючСтроки);
		Запрос.УстановитьПараметр("Площадка", ГруппаПлощадок);
		
		РезультатЗапроса = Запрос.Выполнить();	//	РезультатЗапроса.Выгрузить()
		
		ВыборкаМатрица = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаМатрица.Следующий() Цикл
			КолВоКиосковМатрицы = 0;
			стрМатрица = ДеревоТорговыхПлощадок.Строки.Добавить();
			//ВыборкаОрганизация = ВыборкаМатрица.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			//Пока ВыборкаОрганизация.Следующий() Цикл
			//	//КолВоКиосковРодителя = 0;
			//	стрОрганизация = стрМатрица.Строки.Добавить();
			//	стрОрганизация.ТорговаяПлощадка = ВыборкаОрганизация.Организация;
			//	ВыборкаСклад = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			ВыборкаСклад = ВыборкаМатрица.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			Пока ВыборкаСклад.Следующий()Цикл 
				//стрСклад = стрОрганизация.Строки.Добавить();
				стрСклад = стрМатрица.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(стрСклад,ВыборкаСклад);
				//КолВоКиосковРодителя = КолВоКиосковРодителя + 1 ;
				КолВоКиосковМатрицы = КолВоКиосковМатрицы + 1;
			КонецЦикла;
			//стрРодитель.СкладКомпании = ВыборкаРодитель.Родитель.Наименование + " ("+КолВоКиосковРодителя+")";
			//КонецЦикла;
			стрМатрица.ТорговаяПлощадка = ?(ВыборкаМатрица.Матрица="","ПустаЯ",ВыборкаМатрица.Матрица.Наименование) + " ("+ВыборкаМатрица.Выбранных+" из "+КолВоКиосковМатрицы+")";
		КонецЦикла;
		
		//УстановитьПривилегированныйРежим(Ложь);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТорговыеПлощадки.Ссылка КАК ТорговаяПлощадка,
		|	ТорговыеПлощадки.Родитель КАК Родитель,
		|	ВЫБОР
		|		КОГДА АссортиментныйКомитетПлощадкиПоСтроке.ТорговаяПлощадка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Выбрана
		|ИЗ
		|	Справочник.ТорговыеПлощадки КАК ТорговыеПлощадки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АссортиментныйКомитет.ПлощадкиПоСтроке КАК АссортиментныйКомитетПлощадкиПоСтроке
		|		ПО (АссортиментныйКомитетПлощадкиПоСтроке.Ссылка = &Ссылка)
		|			И ТорговыеПлощадки.Ссылка = АссортиментныйКомитетПлощадкиПоСтроке.ТорговаяПлощадка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТорговыеПлощадки.Ссылка,
		|	ВЫБОР
		|		КОГДА АссортиментныйКомитетПлощадкиПоСтроке.ТорговаяПлощадка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ,
		|	ТорговыеПлощадки.Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТорговаяПлощадка ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();	//	РезультатЗапроса.Выгрузить()
		Выборка = РезультатЗапроса.Выбрать();
		
		СоответствиеРодителей = Новый Соответствие();
		
		// добавляем строки в дерево. Иерархически.
		Пока Выборка.Следующий() Цикл
			//
			Если СоответствиеРодителей[Выборка.Родитель]=Неопределено Тогда
				ТекСтрока = ДеревоТорговыхПлощадок.Строки.Добавить();
			Иначе
				ТекСтрока = СоответствиеРодителей[Выборка.Родитель].Строки.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ТекСтрока,Выборка);
			СоответствиеРодителей.Вставить(Выборка.ТорговаяПлощадка, ТекСтрока);
			// флаг использования
			//ТекСтрока.Выбрана = Выборка.Выбрана;
			
		КонецЦикла;
	КонецЕсли;
	
	//Если ссылки ещё нет - установим галочки по ТЧ подразделений 
	Если Параметры.Ключ.Пустая() Тогда
		мСтрок =  Объект.ПлощадкиПоСтроке.НайтиСтроки(Новый Структура("КлючСтроки",КлючСтроки));
		Для Каждого стчТП Из Объект.ПлощадкиПоСтроке Цикл
			Если стчТП.КлючСтроки = КлючСтроки Тогда
				НайденнаяСтрока = ДеревоТорговыхПлощадок.Строки.Найти(стчТП.ТорговаяПлощадка, "ТорговаяПлощадка", Истина);
				Если НайденнаяСтрока <> Неопределено Тогда
					НайденнаяСтрока.Выбрана = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	ЗначениеВРеквизитФормы(ДеревоТорговыхПлощадок,"ВыбранныеТорговыеПлощадки");
	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаФлажков(ЭлементКоллекции,ЗначениеФлажка)
	//ЭтоУр3 = Ложь;
	//Если ЭлементКоллекции.ПолучитьРодителя() = Неопределено Тогда
	//	Ур1 = ЭлементКоллекции;
	//ИначеЕсли ЭлементКоллекции.ПолучитьРодителя().ПолучитьРодителя() = Неопределено Тогда
	//	Ур1 = ЭлементКоллекции.ПолучитьРодителя();
	//Иначе
	//	ЭтоУр3 = Истина;
	//	Ур1 = ЭлементКоллекции.ПолучитьРодителя().ПолучитьРодителя();
	//КонецЕсли;
	//Матрица = Ур1.ТорговаяПлощадка;
	//нп = СтрНайти(Матрица,"(",НаправлениеПоиска.СКонца);
	//кп = СтрНайти(Матрица," из",НаправлениеПоиска.СКонца);
	//КолВоОтмеченных = 0;
	////КолВоОтмеченных = Сред(Матрица,нп+1,кп-нп-1);
	//КолВоВсего = Сред(Матрица,кп+4,СтрДлина(Матрица)-кп-4);
	//Если ЭтоУр3 Тогда
	//	КолВоОтмеченных = Сред(Матрица,нп+1,кп-нп-1);
	//	Если ЗначениеФлажка Тогда
	//		КолВоОтмеченных = Число(КолВоОтмеченных)+1;
	//	Иначе
	//		КолВоОтмеченных = Число(КолВоОтмеченных)-1;
	//	КонецЕсли;
	//КонецЕсли;
	//Ур1.ТорговаяПлощадка = Лев(Матрица,нп-1)+"("+КолВоОтмеченных+" из "+КолВоВсего+")";
	//Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
	//	
	//			КлючСтроки = Элементы.Товары.ТекущиеДанные.КлючСтроки;
	
	КлючСтроки = Элементы.Товары.ТекущиеДанные.КлючСтроки;
	//ПлощадкиПоКлючу = Объект.ПлощадкиПоСтроке.Выгрузить(Новый Структура("КлючСтроки",КлючСтроки));
	мВыбранныхПлощадок = Новый Массив;
	
	ПодчинЭлементы = ЭлементКоллекции.ПолучитьЭлементы();
	Если Не ЗначениеЗаполнено(ПодчинЭлементы) Тогда
		мВыбранныхПлощадок.Добавить(ЭлементКоллекции.ТорговаяПлощадка);
		//ЗаписатьСтрокуДерева(ПлощадкиПоКлючу,ЭлементКоллекции.ТорговаяПлощадка,ЗначениеФлажка,КлючСтроки);
	КонецЕсли;
	Для Каждого ТекЭлемент Из ПодчинЭлементы Цикл
		Если ТекЭлемент.Выбрана = ЗначениеФлажка Тогда
			Продолжить;
		КонецЕсли;
		ТекЭлемент.Выбрана = ЗначениеФлажка;
		//// проверим, а надо ли записывать
		//Если ТипЗнч(ТекЭлемент.ТорговаяПлощадка) = Тип("СправочникСсылка.ТорговыеПлощадки") Тогда
		//	Если ЗначениеЗаполнено(ТекЭлемент.ТорговаяПлощадка) И ТекЭлемент.Выбрана Тогда
		мВыбранныхПлощадок.Добавить(ТекЭлемент.ТорговаяПлощадка);
		//ЗаписатьСтрокуДерева(ПлощадкиПоКлючу,ТекЭлемент.ТорговаяПлощадка,ЗначениеФлажка,КлючСтроки);
		//КонецЕсли;
		//КонецЕсли;
		//УстановкаФлажков(ТекЭлемент, ЗначениеФлажка);
	КонецЦикла;
	ЗаписатьСтрокуДерева(мВыбранныхПлощадок,ЗначениеФлажка,КлючСтроки);
	
	
	Элементы.ВыбранныеТорговыеПлощадкиТорговаяПлощадка.Заголовок = "Объектов "+КоличествоТТПоСтроке(КлючСтроки);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМаксКлючСтроки()
	
	ТЗТовары = Объект.Товары.Выгрузить();
	ТЗТовары.Сортировать("КлючСтроки УБЫВ");
	
	Если ТЗТовары.Количество() = 0 тогда
		МаксКлюч = 0;
	Иначе
		МаксКлюч = ТЗТовары[0].КлючСтроки;
	КонецЕсли;
	
	Возврат МаксКлюч;
	
КонецФункции

&НаСервере
Процедура ЗаписатьСтрокуДерева(мПлощадок,Выбрана,КлючСтроки)
	//ПлощадкиПоКлючу = Объект.ПлощадкиПоСтроке.Выгрузить(Новый Структура("КлючСтроки",КлючСтроки));
	
	Для Каждого Площадка ИЗ мПлощадок Цикл 
		// проверим, а надо ли записывать
		Если ТипЗнч(Площадка) = Тип("СправочникСсылка.ТорговыеПлощадки") И ЗначениеЗаполнено(Площадка) Тогда
			
			мСтрок = Объект.ПлощадкиПоСтроке.НайтиСтроки(Новый Структура("КлючСтроки,ТорговаяПлощадка",КлючСтроки,Площадка));
			Если Выбрана Тогда
				Если мСтрок.Количество() = 0 Тогда 
					НоваяЗапись = Объект.ПлощадкиПоСтроке.Добавить();
					НоваяЗапись.КлючСтроки = КлючСтроки;
					НоваяЗапись.ТорговаяПлощадка = Площадка;
				КонецЕсли;
			Иначе
				Для Каждого строка Из мСтрок Цикл
					Объект.ПлощадкиПоСтроке.Удалить(строка);		
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСписку(Данные)
	Подсказка = "Введите новый код с новой строки";
	Строка = "";
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводСтроки", ЭтаФорма,Данные);
	ПоказатьВводСтроки(ОписаниеОповещения, Строка, Подсказка,,Истина);
КонецПроцедуры


&НаСервере
Процедура ВводСтроки(ПолученноеЗначение, Параметры) Экспорт
	
	Если Параметры.Данные = "Номенклатура" Тогда	
		Для й=1 По СтрЧислоСтрок(ПолученноеЗначение) Цикл
			зн = СокрЛП(СтрПолучитьСтроку(ПолученноеЗначение,й));
			Если ПустаяСтрока(зн) Тогда
				Продолжить;
			КонецЕсли;
			
			Элем = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",зн);
			Если Элем = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда
				Сообщить("Номенклатура не найдена, артикул: " +зн);
				Продолжить;
			КонецЕсли;
			
			Если Элем.ЭтоГруппа Тогда
				Сообщить("Введена группа номенклатуры '"+Элем+"'");
				Продолжить;
			КонецЕсли;
			
			
			//Если Объект.Товары.НайтиСтроки(Новый Структура(Параметры.Данные,Элем)).Количество() = 0 Тогда
			СтрокаТЧ = Объект.Товары.Добавить();
			СтрокаТЧ.Артикул = Элем.Артикул;
			СтрокаТЧ.Номенклатура = Элем;
			СтрокаТЧ.КлючСтроки = 1 + ПолучитьМаксКлючСтроки();
			//КонецЕсли;
		КонецЦикла;
	ИначеЕсли Параметры.Данные = "Площадки" Тогда
		СоответствиеПлощадок = Новый Соответствие;
		Попытка
			СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000002"),Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000110"));	//	ТС АТТИКА
		Исключение
		КонецПопытки;
		Попытка
			СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("AT000009"),Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("ХGL000285"));		//	ТС Табакко
		Исключение
		КонецПопытки;
		Попытка
			СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000008"),Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("YY000118"));		//	ТС Buffet
		Исключение
		КонецПопытки;
		Попытка
			СоответствиеПлощадок.Вставить(Справочники.ПодразделенияКомпании.НайтиПодразделениеПоКоду("000000001"),Справочники.ТорговыеПлощадки.НайтиТорговуюПлощадкуПоКоду("YY000090"));		//	ТС ДИГМА
		Исключение
		КонецПопытки;
		РодительПлощадки = СоответствиеПлощадок.Получить(Объект.ПодразделениеКомпании);
		
		ПлощадкиПоСтроке = Объект.ПлощадкиПоСтроке;
		Для й=1 По СтрЧислоСтрок(ПолученноеЗначение) Цикл
			зн = СокрЛП(СтрПолучитьСтроку(ПолученноеЗначение,й));
			Если ПустаяСтрока(зн) Тогда
				Продолжить;
			КонецЕсли;
			
			Элем = Справочники.СкладыКомпании.НайтиПоКоду(зн);
			Если Элем = ПредопределенноеЗначение("Справочник.СкладыКомпании.ПустаяСсылка") Тогда
				Сообщить("Склад не найден, код: " +зн);
				Продолжить;
			КонецЕсли;
			
			Если Элем.ЭтоГруппа Тогда
				Сообщить("Введена группа склада '"+Элем+"'");
				Продолжить;
			КонецЕсли;
			
			Если Элем.ТорговаяПлощадка = ПредопределенноеЗначение("Справочник.ТорговыеПлощадки.ПустаяСсылка") Тогда
				Сообщить("Торговая площадка не заполнена у склада: " +Элем);
				Продолжить;
			КонецЕсли;
			
			//мСтрок = ПлощадкиПоСтроке.НайтиСтроки(Новый Структура("КлючСтроки,ТорговаяПлощадка",Параметры.КлючСтроки,Элем.ТорговаяПлощадка));
			Если ПлощадкиПоСтроке.НайтиСтроки(Новый Структура("КлючСтроки,ТорговаяПлощадка",Параметры.КлючСтроки,Элем.ТорговаяПлощадка)).Количество() = 0 Тогда
				Если Элем.ТорговаяПлощадка.ПринадлежитЭлементу(РодительПлощадки) Тогда 
					НоваяЗапись = ПлощадкиПоСтроке.Добавить();
					НоваяЗапись.КлючСтроки = Параметры.КлючСтроки;
					НоваяЗапись.ТорговаяПлощадка = Элем.ТорговаяПлощадка;
				Иначе
					СообЩить(Элем.Код+" "+Элем+" - не принадлежит подразделению документа!!!");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ЗаполнитьДеревоТорговыхПолощадок(Параметры.КлючСтроки);
		Элементы.ВыбранныеТорговыеПлощадкиТорговаяПлощадка.Заголовок = "Объектов "+Объект.ПлощадкиПоСтроке.НайтиСтроки(Новый Структура("КлючСтроки",Параметры.КлючСтроки)).Количество();
		
		
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат,Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Попытка 
			Записать(РежимЗаписиДокумента.Запись);
			ПроверитьСоздатьОбновитьНоменклатуру();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция КоличествоТТПоСтроке(КлючСтроки) Экспорт
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСтроки",КлючСтроки);
	ПоискСтрок = Объект.ПлощадкиПоСтроке.НайтиСтроки(Отбор);
	
	Возврат ПоискСтрок.Количество();
	
КонецФункции	


#КонецОбласти


#Область РаботаСБуферомОбмена

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	//СтруктураНаименованийТабличныхЧастей = Новый Структура("Товары");
	//ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(СтруктураНаименованийТабличныхЧастей);
КонецПроцедуры















#КонецОбласти
